[
	{
		"name": "Space Finder",
		"features": [
			{
				"name": "Space Finder",
				"description": [
					"Space Finder is a secure online platform for photo storage, organization, and sharing. It simplifies photo management with features like uploading, geotagging, and album curation. Ideal for individuals, families, photographers, and travelers, it combines user-friendliness with robust sharing capabilities for digital memory preservation.",
					"Additionally, Space Finder offers flexibility in deployment, allowing users to establish their own AWS instance, personalize it with a domain, and create a user pool for enhanced control. It's a go-to solution for reliable, customized digital photo management."
				],
				"githubURL": "https://github.com/ErnestLeung52/space-finder-services",
				"hostURL": "",
				"techStack": [],
				"imageSrc": "/projectScreenshot/spaceFinder.png",
				"imageAlt": "spaceFinder"
			}
		]
	},
	{
		"name": "Contractual",
		"features": [
			{
				"name": "Contractual",
				"description": [
					"Contractual is a tool designed to streamline team-based web development for JS and Node.js applications. It focuses on \"Contract Driven Development\", which optimizes efficient interaction between different segments of an application.",
					"\"Contract\" refers to the data agreement between client and server. With Contractual, teams define these contracts via a user-friendly interface, enabling independent, confident testing by frontend and backend developers for seamless integration and improved productivity."
				],
				"githubURL": "https://github.com/ErnestLeung52/contractual",
				"hostURL": "https://www.contractualapp.io/",
				"techStack": [],
				"imageSrc": "/projectScreenshot/contractual.png",
				"imageAlt": "Contractual"
			}
		]
	},
	{
		"name": "Code Station",
		"features": [
			{
				"name": "Code Station",
				"description": [
					"Code-Station is a compact, efficient browser-based coding platform that allows interactive JavaScript programming, comprehensive markdown documentation, and easy sharing. It provides a dynamic coding environment accessible from anywhere, fostering collaboration and learning.",
					"The platform boasts user-friendly features, allowing text cell editing and treating code from different cells as a single file for easy referencing. It includes a built-in 'show' function to display various values, and offers the flexibility to reorder, delete, or add cells, catering to a developer's diverse needs."
				],
				"githubURL": "https://github.com/ErnestLeung52/Code-station",
				"hostURL": "",
				"techStack": [],
				"imageSrc": "/projectScreenshot/codeStation.png",
				"imageAlt": "Code Station"
			}
		]
	},

	{
		"name": "InvoGen",
		"features": [
			{
				"name": "InvoGen",
				"description": [
					"Introducing InvoGen, a user-friendly app designed to revolutionize invoicing. With a sleek interface and intuitive features, InvoGen makes generating custom, brand-aligned invoices effortless, using a variety of templates.",
					"InvoGen enhances user experience by coupling functionality with design. Offering a range of choices for professional, unique invoices, it streamlines business operations, providing an immersive, efficient invoicing solution."
				],
				"githubURL": "https://github.com/ErnestLeung52/Onyx-InvoGen",
				"hostURL": "",
				"techStack": [],
				"imageSrc": "/projectScreenshot/InvoGen.png",
				"imageAlt": "InvoGen"
			}
		]
	}
]
